{
  "nodes": [
    {
      "op": "null", 
      "name": "input_ids", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "input_mask", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "segment_ids", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_less_add_where_take_add_less_add_where_take_add", 
      "attrs": {
        "num_inputs": "5", 
        "num_outputs": "1", 
        "hash": "889d982039efff42", 
        "flatten_data": "0", 
        "func_name": "fused_less_add_where_take_add_less_add_where_take_add"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_mean", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "bf9b5af56d5a6b64", 
        "flatten_data": "0", 
        "func_name": "fused_mean"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract48", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "975fdfdc59f8499d", 
        "flatten_data": "0", 
        "func_name": "fused_subtract"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_power_mean48", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "b7d2fee587f30ebd", 
        "flatten_data": "0", 
        "func_name": "fused_power_mean"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_add_sqrt_divide_multiply_add47", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "67cbc10c298fb5fd", 
        "flatten_data": "0", 
        "func_name": "fused_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "cb77f2ff5ed98fc9", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_347", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape23", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "d655245ca60f8050", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_348", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape_transpose", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "3dfe2e83057cd944", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape_transpose"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_523", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "68ab0c20af61dea9", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_5"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_expand_dims_expand_dims_cast_subtract_multiply", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "e662d689d6154a20", 
        "flatten_data": "0", 
        "func_name": "fused_expand_dims_expand_dims_cast_subtract_multiply"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_divide_add23", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "f1bcf2cadc14408c", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_divide_add"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_max", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "f0a07b07bcd5ed6c", 
        "flatten_data": "0", 
        "func_name": "fused_max"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract_exp23", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "a3ff2c59987d906f", 
        "flatten_data": "0", 
        "func_name": "fused_subtract_exp"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_sum", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "7f1af191a4451f42", 
        "flatten_data": "0", 
        "func_name": "fused_sum"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_divide_reshape23", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "7520bf3e489072f0", 
        "flatten_data": "0", 
        "func_name": "fused_divide_reshape"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_349", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape_transpose_1", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "bf0f06ad5d2e2a20", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape_transpose_1"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_423", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "b56010eb624a5e5e", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_4"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_transpose_reshape23", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "d8d0160694ec74e7", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_346", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_add47", 
      "attrs": {
        "num_inputs": "3", 
        "num_outputs": "1", 
        "hash": "fe068edb17b71e51", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_add"
      }, 
      "inputs": [
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_mean1", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "bf9b5af56d5a6b64", 
        "flatten_data": "0", 
        "func_name": "fused_mean"
      }, 
      "inputs": [
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract47", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "975fdfdc59f8499d", 
        "flatten_data": "0", 
        "func_name": "fused_subtract"
      }, 
      "inputs": [
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_power_mean47", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "b7d2fee587f30ebd", 
        "flatten_data": "0", 
        "func_name": "fused_power_mean"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_add_sqrt_divide_multiply_add46", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "67cbc10c298fb5fd", 
        "flatten_data": "0", 
        "func_name": "fused_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "cb77f2ff5ed98fc9", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_223", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "374ce42026895e7a", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_2"
      }, 
      "inputs": [
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_multiply_divide_erf_add_multiply_reshape23", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "e180af670aafc97c", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_multiply_divide_erf_add_multiply_reshape"
      }, 
      "inputs": [
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_123", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "311c066e63df8220", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_1"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_add46", 
      "attrs": {
        "num_inputs": "3", 
        "num_outputs": "1", 
        "hash": "fe068edb17b71e51", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_add"
      }, 
      "inputs": [
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_mean2", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "bf9b5af56d5a6b64", 
        "flatten_data": "0", 
        "func_name": "fused_mean"
      }, 
      "inputs": [
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract46", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "975fdfdc59f8499d", 
        "flatten_data": "0", 
        "func_name": "fused_subtract"
      }, 
      "inputs": [
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_power_mean46", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "b7d2fee587f30ebd", 
        "flatten_data": "0", 
        "func_name": "fused_power_mean"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_add_sqrt_divide_multiply_add45", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "67cbc10c298fb5fd", 
        "flatten_data": "0", 
        "func_name": "fused_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          56, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "cb77f2ff5ed98fc9", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          59, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_345", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape22", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "d655245ca60f8050", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_350", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape_transpose1", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "3dfe2e83057cd944", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape_transpose"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_522", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "68ab0c20af61dea9", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_5"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_divide_add22", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "f1bcf2cadc14408c", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_divide_add"
      }, 
      "inputs": [
        [
          69, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_max1", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "f0a07b07bcd5ed6c", 
        "flatten_data": "0", 
        "func_name": "fused_max"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract_exp22", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "a3ff2c59987d906f", 
        "flatten_data": "0", 
        "func_name": "fused_subtract_exp"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_sum1", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "7f1af191a4451f42", 
        "flatten_data": "0", 
        "func_name": "fused_sum"
      }, 
      "inputs": [
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_divide_reshape22", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "7520bf3e489072f0", 
        "flatten_data": "0", 
        "func_name": "fused_divide_reshape"
      }, 
      "inputs": [
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_351", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape_transpose_11", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "bf0f06ad5d2e2a20", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape_transpose_1"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_422", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "b56010eb624a5e5e", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_4"
      }, 
      "inputs": [
        [
          74, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_transpose_reshape22", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "d8d0160694ec74e7", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_344", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_add45", 
      "attrs": {
        "num_inputs": "3", 
        "num_outputs": "1", 
        "hash": "fe068edb17b71e51", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_add"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_mean3", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "bf9b5af56d5a6b64", 
        "flatten_data": "0", 
        "func_name": "fused_mean"
      }, 
      "inputs": [
        [
          84, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract45", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "975fdfdc59f8499d", 
        "flatten_data": "0", 
        "func_name": "fused_subtract"
      }, 
      "inputs": [
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_power_mean45", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "b7d2fee587f30ebd", 
        "flatten_data": "0", 
        "func_name": "fused_power_mean"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_add_sqrt_divide_multiply_add44", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "67cbc10c298fb5fd", 
        "flatten_data": "0", 
        "func_name": "fused_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "cb77f2ff5ed98fc9", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_222", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "374ce42026895e7a", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_2"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_multiply_divide_erf_add_multiply_reshape22", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "e180af670aafc97c", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_multiply_divide_erf_add_multiply_reshape"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_122", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "311c066e63df8220", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_1"
      }, 
      "inputs": [
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_add44", 
      "attrs": {
        "num_inputs": "3", 
        "num_outputs": "1", 
        "hash": "fe068edb17b71e51", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_add"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          98, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_mean4", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "bf9b5af56d5a6b64", 
        "flatten_data": "0", 
        "func_name": "fused_mean"
      }, 
      "inputs": [
        [
          99, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract44", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "975fdfdc59f8499d", 
        "flatten_data": "0", 
        "func_name": "fused_subtract"
      }, 
      "inputs": [
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_power_mean44", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "b7d2fee587f30ebd", 
        "flatten_data": "0", 
        "func_name": "fused_power_mean"
      }, 
      "inputs": [
        [
          101, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_add_sqrt_divide_multiply_add43", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "67cbc10c298fb5fd", 
        "flatten_data": "0", 
        "func_name": "fused_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          102, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "cb77f2ff5ed98fc9", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          105, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_343", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape21", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "d655245ca60f8050", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          108, 
          0, 
          0
        ], 
        [
          109, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_352", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape_transpose2", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "3dfe2e83057cd944", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape_transpose"
      }, 
      "inputs": [
        [
          112, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_521", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "68ab0c20af61dea9", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_5"
      }, 
      "inputs": [
        [
          110, 
          0, 
          0
        ], 
        [
          114, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_divide_add21", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "f1bcf2cadc14408c", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_divide_add"
      }, 
      "inputs": [
        [
          115, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_max2", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "f0a07b07bcd5ed6c", 
        "flatten_data": "0", 
        "func_name": "fused_max"
      }, 
      "inputs": [
        [
          116, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract_exp21", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "a3ff2c59987d906f", 
        "flatten_data": "0", 
        "func_name": "fused_subtract_exp"
      }, 
      "inputs": [
        [
          116, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_sum2", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "7f1af191a4451f42", 
        "flatten_data": "0", 
        "func_name": "fused_sum"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_divide_reshape21", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "7520bf3e489072f0", 
        "flatten_data": "0", 
        "func_name": "fused_divide_reshape"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ], 
        [
          119, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_353", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape_transpose_12", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "bf0f06ad5d2e2a20", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape_transpose_1"
      }, 
      "inputs": [
        [
          122, 
          0, 
          0
        ], 
        [
          123, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_421", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "b56010eb624a5e5e", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_4"
      }, 
      "inputs": [
        [
          120, 
          0, 
          0
        ], 
        [
          124, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_transpose_reshape21", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "d8d0160694ec74e7", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          125, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_342", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          126, 
          0, 
          0
        ], 
        [
          127, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_add43", 
      "attrs": {
        "num_inputs": "3", 
        "num_outputs": "1", 
        "hash": "fe068edb17b71e51", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_add"
      }, 
      "inputs": [
        [
          128, 
          0, 
          0
        ], 
        [
          129, 
          0, 
          0
        ], 
        [
          105, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_mean5", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "bf9b5af56d5a6b64", 
        "flatten_data": "0", 
        "func_name": "fused_mean"
      }, 
      "inputs": [
        [
          130, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract43", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "975fdfdc59f8499d", 
        "flatten_data": "0", 
        "func_name": "fused_subtract"
      }, 
      "inputs": [
        [
          130, 
          0, 
          0
        ], 
        [
          131, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_power_mean43", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "b7d2fee587f30ebd", 
        "flatten_data": "0", 
        "func_name": "fused_power_mean"
      }, 
      "inputs": [
        [
          132, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_add_sqrt_divide_multiply_add42", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "67cbc10c298fb5fd", 
        "flatten_data": "0", 
        "func_name": "fused_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          133, 
          0, 
          0
        ], 
        [
          132, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ], 
        [
          135, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "cb77f2ff5ed98fc9", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          136, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_221", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "374ce42026895e7a", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_2"
      }, 
      "inputs": [
        [
          137, 
          0, 
          0
        ], 
        [
          138, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_multiply_divide_erf_add_multiply_reshape21", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "e180af670aafc97c", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_multiply_divide_erf_add_multiply_reshape"
      }, 
      "inputs": [
        [
          139, 
          0, 
          0
        ], 
        [
          140, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_121", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "311c066e63df8220", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_1"
      }, 
      "inputs": [
        [
          141, 
          0, 
          0
        ], 
        [
          142, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_add42", 
      "attrs": {
        "num_inputs": "3", 
        "num_outputs": "1", 
        "hash": "fe068edb17b71e51", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_add"
      }, 
      "inputs": [
        [
          143, 
          0, 
          0
        ], 
        [
          144, 
          0, 
          0
        ], 
        [
          136, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_mean6", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "bf9b5af56d5a6b64", 
        "flatten_data": "0", 
        "func_name": "fused_mean"
      }, 
      "inputs": [
        [
          145, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract42", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "975fdfdc59f8499d", 
        "flatten_data": "0", 
        "func_name": "fused_subtract"
      }, 
      "inputs": [
        [
          145, 
          0, 
          0
        ], 
        [
          146, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_power_mean42", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "b7d2fee587f30ebd", 
        "flatten_data": "0", 
        "func_name": "fused_power_mean"
      }, 
      "inputs": [
        [
          147, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_add_sqrt_divide_multiply_add41", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "67cbc10c298fb5fd", 
        "flatten_data": "0", 
        "func_name": "fused_add_sqrt_divide_multiply_add"
      }, 
      "inputs": [
        [
          148, 
          0, 
          0
        ], 
        [
          147, 
          0, 
          0
        ], 
        [
          149, 
          0, 
          0
        ], 
        [
          150, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "cb77f2ff5ed98fc9", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          151, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_341", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          152, 
          0, 
          0
        ], 
        [
          153, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape20", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "d655245ca60f8050", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          154, 
          0, 
          0
        ], 
        [
          155, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_354", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "31f7c910b008dfbf", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_3"
      }, 
      "inputs": [
        [
          152, 
          0, 
          0
        ], 
        [
          157, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_add_reshape_transpose_reshape_transpose3", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "3dfe2e83057cd944", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_add_reshape_transpose_reshape_transpose"
      }, 
      "inputs": [
        [
          158, 
          0, 
          0
        ], 
        [
          159, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_matmul_520", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "68ab0c20af61dea9", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_matmul_5"
      }, 
      "inputs": [
        [
          156, 
          0, 
          0
        ], 
        [
          160, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_divide_add20", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "f1bcf2cadc14408c", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_divide_add"
      }, 
      "inputs": [
        [
          161, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_max3", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "f0a07b07bcd5ed6c", 
        "flatten_data": "0", 
        "func_name": "fused_max"
      }, 
      "inputs": [
        [
          162, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract_exp20", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "a3ff2c59987d906f", 
        "flatten_data": "0", 
        "func_name": "fused_subtract_exp"
      }, 
      "inputs": [
        [
          162, 
          0, 
          0
        ], 
        [
          163, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_sum3", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "7f1af191a4451f42", 
        "flatten_data": "0", 
        "func_name": "fused_sum"
      }, 
      "inputs": [
        [
          164, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_divide_reshape20", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "7520bf3e489072f0", 
        "flatten_data": "0", 
        "func_name": "fused_divide_reshape"
      }, 
      "inputs": [
        [
          164, 
          0, 
          0
