{
  "nodes": [
    {
      "op": "null", 
      "name": "input_tensor:0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_11", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "50731c9c02c3b9ed", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_11"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "layout": "NCHW", 
        "func_name": "fused_nn_max_pool2d", 
        "flatten_data": "0", 
        "hash": "f9f55142929595ff", 
        "num_inputs": "1"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_10", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "5b4672c0e2e5de03", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_10"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_32", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "aaa90ed0f03b4529", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_3"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "f83baeb5d599176a", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_32", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "71ca13650ce271af", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_3"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_91", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "620e920b23a0bbe6", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_9"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_31", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "aaa90ed0f03b4529", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_3"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_31", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "71ca13650ce271af", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_3"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_9", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "620e920b23a0bbe6", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_9"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "aaa90ed0f03b4529", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_3"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "71ca13650ce271af", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_3"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "3d121b950ac9ce96", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_8"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "7f6b6ffd07e27c95", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_7"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_1", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "5488ff2fdb0946ad", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_1"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_23", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "f10df309bf7dd7e9", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_2"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_62", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "3a72836379b812c9", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_6"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_22", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "cc787cc77ff463d3", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_2"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_22", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "f10df309bf7dd7e9", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_2"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_61", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "3a72836379b812c9", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_6"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_21", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "cc787cc77ff463d3", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_2"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_21", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "f10df309bf7dd7e9", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_2"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ], 
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "3a72836379b812c9", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_6"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "cc787cc77ff463d3", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_2"
      }, 
      "inputs": [
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "f10df309bf7dd7e9", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_2"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ], 
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "db1ee72b07ba628c", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_5"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "a671850c5b21d4b2", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_4"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_2", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "318c829093bbecaa", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_2"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          82, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_15", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "fd79717c29bc30e2", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_1"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p56", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p57", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_34", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "5a57725512def445", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_3"
      }, 
      "inputs": [
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p58", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p59", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_14", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "bf6f5bd0fd7f05ee", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_1"
      }, 
      "inputs": [
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p60", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p61", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_14", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "fd79717c29bc30e2", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_1"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ], 
        [
          93, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p62", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_33", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "5a57725512def445", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_3"
      }, 
      "inputs": [
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p64", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p65", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_13", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "bf6f5bd0fd7f05ee", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_1"
      }, 
      "inputs": [
        [
          97, 
          0, 
          0
        ], 
        [
          98, 
          0, 
          0
        ], 
        [
          99, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p66", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p67", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_13", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "fd79717c29bc30e2", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_1"
      }, 
      "inputs": [
        [
          100, 
          0, 
          0
        ], 
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p68", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p69", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_32", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "5a57725512def445", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_3"
      }, 
      "inputs": [
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          0
        ], 
        [
          105, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p70", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_12", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "bf6f5bd0fd7f05ee", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_1"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          107, 
          0, 
          0
        ], 
        [
          108, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p72", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p73", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_12", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "fd79717c29bc30e2", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_1"
      }, 
      "inputs": [
        [
          109, 
          0, 
          0
        ], 
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p74", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p75", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_31", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "5a57725512def445", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_3"
      }, 
      "inputs": [
        [
          112, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          0
        ], 
        [
          114, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p76", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p77", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_11", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "bf6f5bd0fd7f05ee", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_1"
      }, 
      "inputs": [
        [
          115, 
          0, 
          0
        ], 
        [
          116, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p78", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p79", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_11", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "fd79717c29bc30e2", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_1"
      }, 
      "inputs": [
        [
          118, 
          0, 
          0
        ], 
        [
          119, 
          0, 
          0
        ], 
        [
          120, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p80", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p81", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "5a57725512def445", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_3"
      }, 
      "inputs": [
        [
          121, 
          0, 
          0
        ], 
        [
          122, 
          0, 
          0
        ], 
        [
          123, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p82", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p83", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "bf6f5bd0fd7f05ee", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu_1"
      }, 
      "inputs": [
        [
          124, 
          0, 
          0
        ], 
        [
          125, 
          0, 
          0
        ], 
        [
          126, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p84", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p85", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "fd79717c29bc30e2", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu_1"
      }, 
      "inputs": [
        [
          127, 
          0, 
          0
        ], 
        [
          128, 
          0, 
          0
        ], 
        [
          129, 
          0, 
          0
        ], 
        [
          121, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p86", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p87", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "a318e20164bad2c7", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_2"
      }, 
      "inputs": [
        [
          130, 
          0, 
          0
        ], 
        [
          131, 
          0, 
          0
        ], 
        [
          132, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p88", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p89", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "be2e44a971ba54fd", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_1"
      }, 
      "inputs": [
        [
          133, 
          0, 
          0
        ], 
        [
          134, 
          0, 
          0
        ], 
        [
          135, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p90", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p91", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p92", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p93", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_3", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "73fde6def213976b", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_3"
      }, 
      "inputs": [
        [
          130, 
          0, 
          0
        ], 
        [
          139, 
          0, 
          0
        ], 
        [
          140, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu2", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "b89ac7218f6f9af6", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu"
      }, 
      "inputs": [
        [
          136, 
          0, 
          0
        ], 
        [
          137, 
          0, 
          0
        ], 
        [
          138, 
          0, 
          0
        ], 
        [
          141, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p94", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p95", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu1", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "d32393c918274c13", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu"
      }, 
      "inputs": [
        [
          142, 
          0, 
          0
        ], 
        [
          143, 
          0, 
          0
        ], 
        [
          144, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p96", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p97", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu1", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "3e5bb3a812dc8a76", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu"
      }, 
      "inputs": [
        [
          145, 
          0, 
          0
        ], 
        [
          146, 
          0, 
          0
        ], 
        [
          147, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p98", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p99", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu1", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "b89ac7218f6f9af6", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu"
      }, 
      "inputs": [
        [
          148, 
          0, 
          0
        ], 
        [
          149, 
          0, 
          0
        ], 
        [
          150, 
          0, 
          0
        ], 
        [
          142, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p100", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p101", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "d32393c918274c13", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu"
      }, 
      "inputs": [
        [
          151, 
          0, 
          0
        ], 
        [
          152, 
          0, 
          0
        ], 
        [
          153, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p102", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p103", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "3e5bb3a812dc8a76", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu"
      }, 
      "inputs": [
        [
          154, 
          0, 
          0
        ], 
        [
          155, 
          0, 
          0
        ], 
        [
          156, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p104", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p105", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_add_nn_relu", 
        "hash": "b89ac7218f6f9af6", 
        "num_inputs": "4", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW"
      }, 
      "inputs": [
        [
          157, 
          0, 
          0
        ], 
        [
          158, 
          0, 
          0
        ], 
        [
          159, 
          0, 
          0
        ], 
        [
          151, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_mean", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "acd2c06af9ea6183", 
        "flatten_data": "0", 
        "func_name": "fused_mean"
      }, 
      "inputs": [
        [
          160, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_squeeze_nn_batch_flatten", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "96fe5d179b56bf61", 
        "flatten_data": "0", 
        "func_name": "fused_squeeze_nn_batch_flatten"
      }, 
      "inputs": [
        [
          161, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p106", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p107", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_dense_add", 
      "attrs": {
        "num_inputs": "3", 
        "num_outputs": "1", 
        "hash": "1d2d9510f0922b76", 
        "flatten_data": "0", 
        "func_name": "fused_nn_dense_add"
      }, 
      "inputs": [
        [
          162, 
          0, 
          0
        ], 
        [
          163, 
          0, 
          0
        ], 
        [
          164, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_argmax", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "ba2f862ee0888518", 
        "flatten_data": "0", 
        "func_name": "fused_argmax"
      }, 
      "inputs": [
        [
          165, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "22b5529b4f39f6ab", 
        "flatten_data": "0", 
        "func_name": "fused_cast"
      }, 
      "inputs": [
        [
          166, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_max", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "7b258e9f60f5f8a8", 
        "flatten_data": "0", 
        "func_name": "fused_max"
      }, 
      "inputs": [
        [
          165, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_subtract_exp", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "114821125f2c2e3b", 
        "flatten_data": "0", 
        "func_name": "fused_subtract_exp"
      }, 
      "inputs": [
        [
          165, 
          0, 
          0
        ], 
        [
          168, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_sum", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "e19279b26103bab8", 
        "flatten_data": "0", 
        "func_name": "fused_sum"
      }, 
      "inputs": [
        [
          169, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_divide", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "f0d7316c882a3058", 
        "flatten_data": "0", 
        "func_name": "fused_divide"
      }, 
      "inputs": [
        [
          169, 
          0, 
          0
        ], 
        [
          170, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    8, 
    9, 
    11, 
    12, 
    13, 
    14, 
    17, 
    18, 
    20, 
    21, 
    23, 
    24, 
    26, 
    27, 
    29, 
    30, 
    32, 
    33, 
    35, 
    36, 
    38, 
    39, 
    41, 
    42, 
    43, 
    44, 
    47, 
    48, 
    50, 
    51, 
    53, 
    54, 
    56, 
    57, 
    59, 
    60, 
    62, 
    63, 
    65, 
    66, 
    68, 
    69, 
    71, 
    72, 
    74, 
    75, 
    77, 
    78, 
    80, 
    81, 
    82, 
    83, 
    86, 
    87, 
    89, 
    90, 
    92, 
    93, 
    95, 
    96, 
    98, 
    99, 
    101, 
    102, 
    104, 
    105, 
    107, 
    108, 
    110, 
    111, 
    113, 
    114, 
    116, 
    117, 
    119, 
    120, 
    122, 
    123, 
    125, 
    126, 
    128, 
    129, 
    131, 
    132, 
    134, 
    135, 
    137, 
    138, 
    139, 
    140, 
    143, 
    144, 
    146, 
    147, 
    149, 
    150, 
    152, 
    153, 
    155, 
    156, 
    158, 
    159, 
    163, 
    164
  ], 
  "heads": [
    [
      167, 
      0, 
      0
    ], 
    [
      171, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
