{
  "nodes": [
    {
      "op": "null", 
      "name": "1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "a8ada277db6db3a6", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu_1"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "e2017042ef2e47be", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_contrib_conv2d_winograd_without_weight_transform_add_nn_relu"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "data_layout": "NCHW", 
        "hash": "d785bf92035df073", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add_nn_relu"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add", 
      "attrs": {
        "num_outputs": "1", 
        "flatten_data": "0", 
        "out_layout": "", 
        "func_name": "fused_nn_conv2d_add", 
        "hash": "eb6927210cf62e0a", 
        "num_inputs": "3", 
        "kernel_layout": "OIHW", 
        "data_layout": "NCHW"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_transpose_reshape", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "91dab2e6418a642a", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_transpose_reshape"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [0, 1, 2, 4, 5, 7, 8, 10, 11], 
  "heads": [
    [
      13, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 1, 224, 224], 
        [64, 1, 5, 5], 
        [1, 64, 1, 1], 
        [1, 64, 224, 224], 
        [6, 6, 64, 64], 
        [1, 64, 1, 1], 
        [1, 64, 224, 224], 
        [32, 64, 3, 3], 
        [1, 32, 1, 1], 
        [1, 32, 224, 224], 
        [9, 32, 3, 3], 
        [1, 9, 1, 1], 
        [1, 9, 224, 224], 
        [1, 1, 672, 672]
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        8, 
        3, 
        9, 
        10, 
        6, 
        3
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14
  ]
}